{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "sequential_36", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_26_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_36", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_37", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_27_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_34", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_37", "inbound_nodes": [[["sequential_36", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_38", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_28_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_35", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_38", "inbound_nodes": [[["sequential_37", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_39", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_29_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_36", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_39", "inbound_nodes": [[["sequential_38", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_40", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_30_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_37", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_40", "inbound_nodes": [[["sequential_39", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_41", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_31_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_38", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_41", "inbound_nodes": [[["sequential_40", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_42", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_32_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_39", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_42", "inbound_nodes": [[["sequential_41", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_43", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_33_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_40", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_31", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_43", "inbound_nodes": [[["sequential_42", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_44", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_16_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_16", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_41", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_44", "inbound_nodes": [[["sequential_43", 1, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["sequential_44", 1, 0, {}], ["sequential_42", 1, 0, {}]], [["sequential_45", 1, 0, {}], ["sequential_41", 1, 0, {}]], [["sequential_46", 1, 0, {}], ["sequential_40", 1, 0, {}]], [["sequential_47", 1, 0, {}], ["sequential_39", 1, 0, {}]], [["sequential_48", 1, 0, {}], ["sequential_38", 1, 0, {}]], [["sequential_49", 1, 0, {}], ["sequential_37", 1, 0, {}]], [["sequential_50", 1, 0, {}], ["sequential_36", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_45", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_17_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_42", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_45", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_46", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_18_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_43", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_46", "inbound_nodes": [[["concatenate_2", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_47", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_19_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_44", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_47", "inbound_nodes": [[["concatenate_2", 2, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_48", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_20_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_45", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_48", "inbound_nodes": [[["concatenate_2", 3, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_49", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_21_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_21", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_46", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "ReLU", "config": {"name": "re_lu_19", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_49", "inbound_nodes": [[["concatenate_2", 4, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_50", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_22_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_22", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "InstanceNormalization", "config": {"name": "instance_normalization_47", "trainable": true, "dtype": "float32", "epsilon": 1e-05}}, {"class_name": "ReLU", "config": {"name": "re_lu_20", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_50", "inbound_nodes": [[["concatenate_2", 5, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_23", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_23", "inbound_nodes": [[["concatenate_2", 6, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_transpose_23", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "conv2d_transpose_23/kernel", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "conv2d_transpose_23/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_26/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_27/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "instance_normalization_34/scale", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_34/offset", "shape": [128], "dtype": "float32"}, {"name": "conv2d_28/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "instance_normalization_35/scale", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_35/offset", "shape": [256], "dtype": "float32"}, {"name": "conv2d_29/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "instance_normalization_36/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_36/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_30/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "instance_normalization_37/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_37/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_31/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "instance_normalization_38/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_38/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_32/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "instance_normalization_39/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_39/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_33/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "instance_normalization_40/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_40/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_16/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "instance_normalization_41/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_41/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_17/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "instance_normalization_42/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_42/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_18/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "instance_normalization_43/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_43/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_19/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "instance_normalization_44/scale", "shape": [512], "dtype": "float32"}, {"name": "instance_normalization_44/offset", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_20/kernel", "shape": [4, 4, 256, 1024], "dtype": "float32"}, {"name": "instance_normalization_45/scale", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_45/offset", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_21/kernel", "shape": [4, 4, 128, 512], "dtype": "float32"}, {"name": "instance_normalization_46/scale", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_46/offset", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_22/kernel", "shape": [4, 4, 64, 256], "dtype": "float32"}, {"name": "instance_normalization_47/scale", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_47/offset", "shape": [64], "dtype": "float32"}]}]}